In [3]:
pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (1.4.2)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.18.5 in c:\programdata\anaconda3\lib\site-packages (from pandas) (1.21.5)
Requirement already satisfied: pytz>=2020.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2021.3)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [4]:
import pandas as pd

In [5]:
pip install hypothesis

Defaulting to user installation because normal site-packages is not writeableNote: you may need to restart the kernel to use updated packages.

Requirement already satisfied: hypothesis in c:\users\hp\appdata\roaming\python\python39\site-packages (6.57.1)
Requirement already satisfied: sortedcontainers<3.0.0,>=2.1.0 in c:\programdata\anaconda3\lib\site-packages (from hypothesis) (2.4.0)
Requirement already satisfied: exceptiongroup>=1.0.0 in c:\users\hp\appdata\roaming\python\python39\site-packages (from hypothesis) (1.0.4)
Requirement already satisfied: attrs>=19.2.0 in c:\programdata\anaconda3\lib\site-packages (from hypothesis) (21.4.0)

In [6]:
#pd.test()

In [7]:
#install numexpr
#install bottleneck

In [8]:
#import numpy as np
#import matplotlib.pyplot as plt
#import seaborn as sns

In [9]:
#%matplotlib inline

In [10]:
df = pd.DataFrame(   #calling the DataFrame library 
{
"Name": ["Bayo, Mr. Sennuga Seyi", #assigning name data to the table with dict
    "Kensen, DR. Sennuga Kehinde",
    "Seyi, Sennuga Toyin",],
"Age": [22,60, 38],    #assigning age to the table
"Sex": ["Male", "Male", "Female"], # assigning sex to each name using dict
}
)
df    #calling the DataFrame function

                          Name  Age     Sex
0       Bayo, Mr. Sennuga Seyi   22    Male
1  Kensen, DR. Sennuga Kehinde   60    Male
2          Seyi, Sennuga Toyin   38  Female

In [11]:
df["Age"] #calls the age column data alone

0    22
1    60
2    38
Name: Age, dtype: int64

In [12]:
df["Age"].max()  #Knowing the max in the Age column

60

In [13]:
df.describe() #describes the basic statistics of the num data

             Age
count   3.000000
mean   40.000000
std    19.078784
min    22.000000
25%    30.000000
50%    38.000000
75%    49.000000
max    60.000000

In [14]:
corona = pd.read_csv("Covid Live.csv") #read the csv file with pandas
corona  #call the file to vi

,#,"Country,\nOther",Total\nCases,Total\nDeaths,New\nDeaths,Total\nRecovered,Active\nCases,"Serious,\nCritical",Tot Cases/\n1M pop,Deaths/\n1M pop,Total\nTests,Tests/\n1M pop,Population
0,1,USA,"98,166,904","1,084,282",NaN,"94,962,112","2,120,510","2,970","293,206","3,239","1,118,158,870","3,339,729","334,805,269"
1,2,India,"44,587,307","528,629",NaN,"44,019,095","39,583",698,"31,698",376,"894,416,853","635,857","1,406,631,776"
2,3,France,"35,342,950","155,078",NaN,"34,527,115","660,757",869,"538,892","2,365","271,490,188","4,139,547","65,584,518"
3,4,Brazil,"34,706,757","686,027",NaN,"33,838,636","182,094","8,318","161,162","3,186","63,776,166","296,146","215,353,593"
4,5,Germany,"33,312,373","149,948",NaN,"32,315,200","847,225","1,406","397,126","1,788","122,332,384","1,458,359","83,883,596"
...,...,...,...,...,...,...,...,...,...,...,...,...,...
225,226,Niue,80,NaN,NaN,80,0,NaN,"49,322",NaN,NaN,NaN,"1,622"
226,227,Vatican City,29,NaN,NaN,29,0,NaN,"36,295",NaN,NaN,NaN,799
227,228,Tuvalu,20,NaN,NaN,NaN,20,NaN,"1,658",NaN,NaN,NaN,"12,066"
228,229,Western Sahara,10,1,NaN,9,0,NaN,16,2,NaN,NaN,"626,161"
229,230,MS Zaandam,9,2,NaN,7,0,NaN,NaN,NaN,NaN,NaN,NaN

In [12]:
characters = ["Iron Man", "Spider Man"]
actors = ["Seyi", "Sennuga"]

zip (characters,actors)

In [15]:
corona.head(8)  #list the first 8 headers

,#,"Country,\nOther",Total\nCases,Total\nDeaths,New\nDeaths,Total\nRecovered,Active\nCases,"Serious,\nCritical",Tot Cases/\n1M pop,Deaths/\n1M pop,Total\nTests,Tests/\n1M pop,Population
0,1,USA,"98,166,904","1,084,282",NaN,"94,962,112","2,120,510","2,970","293,206","3,239","1,118,158,870","3,339,729","334,805,269"
1,2,India,"44,587,307","528,629",NaN,"44,019,095","39,583",698,"31,698",376,"894,416,853","635,857","1,406,631,776"
2,3,France,"35,342,950","155,078",NaN,"34,527,115","660,757",869,"538,892","2,365","271,490,188","4,139,547","65,584,518"
3,4,Brazil,"34,706,757","686,027",NaN,"33,838,636","182,094","8,318","161,162","3,186","63,776,166","296,146","215,353,593"
4,5,Germany,"33,312,373","149,948",NaN,"32,315,200","847,225","1,406","397,126","1,788","122,332,384","1,458,359","83,883,596"
5,6,S. Korea,"24,769,101","28,406",42.0,"24,013,461","727,234",352,"482,547",553,"15,804,065","307,892","51,329,899"
6,7,UK,"23,621,952","189,919",NaN,"23,347,871","84,162",146,"344,857","2,773","522,526,476","7,628,357","68,497,907"
7,8,Italy,"22,432,803","177,054",NaN,"21,779,604","476,145",141,"372,250","2,938","246,636,495","4,092,684","60,262,770"

In [16]:
corona.tail(8)

,#,"Country,\nOther",Total\nCases,Total\nDeaths,New\nDeaths,Total\nRecovered,Active\nCases,"Serious,\nCritical",Tot Cases/\n1M pop,Deaths/\n1M pop,Total\nTests,Tests/\n1M pop,Population
222,223,Macao,793,6,NaN,787,0,NaN,"1,188",9,"7,850","11,760","667,490"
223,224,Wallis and Futuna,761,7,NaN,438,316,NaN,"69,295",637,"20,508","1,867,419","10,982"
224,225,Diamond Princess,712,13,NaN,699,0,NaN,NaN,NaN,NaN,NaN,NaN
225,226,Niue,80,NaN,NaN,80,0,NaN,"49,322",NaN,NaN,NaN,"1,622"
226,227,Vatican City,29,NaN,NaN,29,0,NaN,"36,295",NaN,NaN,NaN,799
227,228,Tuvalu,20,NaN,NaN,NaN,20,NaN,"1,658",NaN,NaN,NaN,"12,066"
228,229,Western Sahara,10,1,NaN,9,0,NaN,16,2,NaN,NaN,"626,161"
229,230,MS Zaandam,9,2,NaN,7,0,NaN,NaN,NaN,NaN,NaN,NaN

In [17]:
corona.dtypes

#                       int64
Country,\nOther        object
Total\nCases           object
Total\nDeaths          object
New\nDeaths           float64
Total\nRecovered       object
Active\nCases          object
Serious,\nCritical     object
Tot Cases/\n1M pop     object
Deaths/\n1M pop        object
Total\nTests           object
Tests/\n1M pop         object
Population             object
dtype: object

In [ ]:
corona.to_excel("coronA.xlsx", sheet_name="#", index=False) #The to_excel() method stores the data as an excel file
#sheet_name is patient instead of sheet1
#by setting index=False the row index labels are not saved in d spreadsheet.
corona=pd.read_excel("coronA.xlsx", sheet_name="#")
#the read_excel () will reload data to a DataFrame
corona.head() #Show the top list

In [ ]:
corona.info()

In [ ]:
df["Age"].shape  #shows the no of rows Age has

In [ ]:
age_sex = df[["Age", "Sex"]] #To select multiple columns, use a list of column names within the selection brackets [].
age_sex.head()  #shows the age and sex available in the data
#age_sex    #another method to call it



#NOTE: The inner square brackets define a Python list with column names, whereas the outer brackets are used to select
#the data from a pandas DataFrame as seen in the previous example

In [ ]:
df[["Age", "Sex"]].shape  #remember a DataFrame is 2-dimensional with a row and column dimension

In [ ]:
above_35 = df[df["Age"] > 35] #list data of people who are more than 35years of age
above_35  #calls the function

In [ ]:
df["Age"] > 35

In [ ]:
Class_23 = corona[corona["Serious,\nCritical"].isin([353, 146])] # checks for which rows the Pclass column is either 353 or 146.
Class_23.head()

In [ ]:
Class_24 = corona[(corona["Active\nCases"] == 39583) | (corona["Active\nCases"] == 660757)]
Class_24.head()
#NOTE: When combining multiple conditional statements, each condition must be surrounded by parentheses ().
#Moreover, you can not use or/and but need to use the or operator | and the and operator &.

In [ ]:
Class_25 = df[(df["Age"] == 38) | (df["Age"] <= 60)]
Class_25.head()

In [ ]:
import seaborn as sns
import numpy as np

In [ ]:
%matplotlib inline
#allows us to pplot chart within our notebook

In [ ]:
#Facet Grid
g=sns.FacetGrid(data=corona, col='Total\nDeaths', row='Population')
#this has divided the 3 argument up, rows and column are Total\nDeaths and Population,
#and you want to see what is actually being displayed
g.map(sns.distplot,'Total\nDeaths')

In [1]:
num_list = [21,13,19,3,11,5,18]
num_list.sort()
num_list[len(num_list) //2 ]

13

In [3]:
list(reversed(range(1,11)))

[10, 9, 8, 7, 6, 5, 4, 3, 2, 1]

In [5]:
import math
print(math.pow(2,10))

1024.0

In [6]:
y=1
for i in range(1,10):
    y=y*2
    print(y)

2
4
8
16
32
64
128
256
512

In [8]:
2**10

1024

In [8]:
def jaccard(a,b):
    a=10
    b=2
    return 
a.intersection(b)/a.union(b)
jaccard(a,b)

NameError: name 'a' is not defined

In [13]:
x=18
if x > 15:
    if x > 15:
        print ('A')
    else:
        print('B')
else:
    print('C')

A

In [15]:
{x: [y for y in range(1,x) if x %y ==0] for x in range(2,100)}

{2: [1],
 3: [1],
 4: [1, 2],
 5: [1],
 6: [1, 2, 3],
 7: [1],
 8: [1, 2, 4],
 9: [1, 3],
 10: [1, 2, 5],
 11: [1],
 12: [1, 2, 3, 4, 6],
 13: [1],
 14: [1, 2, 7],
 15: [1, 3, 5],
 16: [1, 2, 4, 8],
 17: [1],
 18: [1, 2, 3, 6, 9],
 19: [1],
 20: [1, 2, 4, 5, 10],
 21: [1, 3, 7],
 22: [1, 2, 11],
 23: [1],
 24: [1, 2, 3, 4, 6, 8, 12],
 25: [1, 5],
 26: [1, 2, 13],
 27: [1, 3, 9],
 28: [1, 2, 4, 7, 14],
 29: [1],
 30: [1, 2, 3, 5, 6, 10, 15],
 31: [1],
 32: [1, 2, 4, 8, 16],
 33: [1, 3, 11],
 34: [1, 2, 17],
 35: [1, 5, 7],
 36: [1, 2, 3, 4, 6, 9, 12, 18],
 37: [1],
 38: [1, 2, 19],
 39: [1, 3, 13],
 40: [1, 2, 4, 5, 8, 10, 20],
 41: [1],
 42: [1, 2, 3, 6, 7, 14, 21],
 43: [1],
 44: [1, 2, 4, 11, 22],
 45: [1, 3, 5, 9, 15],
 46: [1, 2, 23],
 47: [1],
 48: [1, 2, 3, 4, 6, 8, 12, 16, 24],
 49: [1, 7],
 50: [1, 2, 5, 10, 25],
 51: [1, 3, 17],
 52: [1, 2, 4, 13, 26],
 53: [1],
 54: [1, 2, 3, 6, 9, 18, 27],
 55: [1, 5, 11],
 56: [1, 2, 4, 7, 8, 14, 28],
 57: [1, 3, 19],
 58: [1, 2, 29],
 59: [1],
 60: [1, 2, 3, 4, 5, 6, 10, 12, 15, 20, 30],
 61: [1],
 62: [1, 2, 31],
 63: [1, 3, 7, 9, 21],
 64: [1, 2, 4, 8, 16, 32],
 65: [1, 5, 13],
 66: [1, 2, 3, 6, 11, 22, 33],
 67: [1],
 68: [1, 2, 4, 17, 34],
 69: [1, 3, 23],
 70: [1, 2, 5, 7, 10, 14, 35],
 71: [1],
 72: [1, 2, 3, 4, 6, 8, 9, 12, 18, 24, 36],
 73: [1],
 74: [1, 2, 37],
 75: [1, 3, 5, 15, 25],
 76: [1, 2, 4, 19, 38],
 77: [1, 7, 11],
 78: [1, 2, 3, 6, 13, 26, 39],
 79: [1],
 80: [1, 2, 4, 5, 8, 10, 16, 20, 40],
 81: [1, 3, 9, 27],
 82: [1, 2, 41],
 83: [1],
 84: [1, 2, 3, 4, 6, 7, 12, 14, 21, 28, 42],
 85: [1, 5, 17],
 86: [1, 2, 43],
 87: [1, 3, 29],
 88: [1, 2, 4, 8, 11, 22, 44],
 89: [1],
 90: [1, 2, 3, 5, 6, 9, 10, 15, 18, 30, 45],
 91: [1, 7, 13],
 92: [1, 2, 4, 23, 46],
 93: [1, 3, 31],
 94: [1, 2, 47],
 95: [1, 5, 19],
 96: [1, 2, 3, 4, 6, 8, 12, 16, 24, 32, 48],
 97: [1],
 98: [1, 2, 7, 14, 49],
 99: [1, 3, 9, 11, 33]}

In [6]:
name= ('seyi')
def be_friendly(name, greet ='How are you!'):
    return ('Seyi', greet)
be_friendly(name)

('Seyi', 'How are you!')